#include "ss_w09.h"
#include"ss.h"

ss_w09::ss_w09() :Base(eType_Scene)
, m_text1("C:\\Windows\\Fonts\\msgothic.ttc", 50)
{
	m_haikei = COPY_RESOURCE("Fin_haikei", CImage);
	m_next = COPY_RESOURCE("Next", CImage);
	m_next.SetSize(648, 92);
	m_next.SetPos(666, 900);
	m_cnt = 0;
}

void ss_w09::Update()
{
	m_cnt++;
	if (PUSH(CInput::eButton10) && m_cnt > 2)
	{
		Base::SetKill();
		Base::Add(new ss());
	}
}

void ss_w09::Draw()
{
	m_haikei.Draw();
	m_next.Draw();
	//m_text1.Draw(400, 800, 1, 1, 1, "fin");
	
	m_text1.Draw(360, 110, 1, 1, 1, "そこには呪怨の魔女に対峙する一人の男の姿があった");//24文字
	m_text1.Draw(185, 110 + 90, 1, 1, 1, "男は自らの持つ剣の切っ先を魔女に向け鋭い眼差しで魔女を見つめる");//31文字
	m_text1.Draw(310, 110 + 90 + 90, 1, 1, 1, "対する魔女は余裕そうな笑みを浮かべながら男を見下ろす");//26文字
	m_text1.Draw(260, 110 + 90 + 90 + 90, 1, 1, 1, "男の剣先が煌めくと同時に魔女は「カースマインド」と呟いた");//28文字
	m_text1.Draw(210, 110 + 90 + 90 + 90 + 90, 1, 1, 1, "すると魔女の全身から黒い靄のようなものが吹き出し男に殺到する");//30文字
	m_text1.Draw(60, 110 + 90 + 90 + 90 + 90 + 90, 1, 1, 1, "しかし男はそれにも意を介さず特攻し目を見開く魔女に対して剣を振り下ろした");//36文字
	m_text1.Draw(85, 110 + 90 + 90 + 90 + 90 + 90 + 90, 1, 1, 1, "魔女は倒れ男に向けて最後にこう言った「なぜ、呪われぬ　なぜ、私を切る」");//35文字
	m_text1.Draw(110, 110 + 90 + 90 + 90 + 90 + 90 + 90 + 90, 1, 1, 1, "男は答えた「呪怨の魔女でも自分の呪いに呪いを重ねることはできない」と");//34文字
	m_text1.Draw(135, 110 + 90 + 90 + 90 + 90 + 90 + 90 + 90 + 90, 1, 1, 1, "魔女は男の体を見て「盲点であった」最後にそんな言葉をこぼし息絶えた");//33文字
	
}